FIELDS_DICT = {
    "血常规": ["姓名", "性别", "年龄", "科室", "床号", "住院号", "医生", "临床诊断", "标本类型",
                       "标本编号", "流水号", "检验项目",  "超敏C反应蛋白(hsCRP)", "C反应蛋白(CRP)",
                       "血清淀粉样蛋白A(SAA)","白细胞计数(WBC)", "红细胞计数（RBC）",
                       "血红蛋白(HGB)", "血小板计数(PLT)", "红细胞比积(HCT)", "平均红细胞体积(MCV)",
                       "平均红细胞血红蛋白含量(MCH)", "平均红细胞血红蛋白浓度(MCHC)", "红细胞体积分布宽度(CV)(RDW-CV)",
                       "红细胞体积分布宽度(SD)(RDW-SD)", "淋巴细胞百分比(LYM%)", "中性粒细胞百分比(NEUT%)",
                       "单核细胞百分比(MONO%)","嗜酸性粒细胞百分比(EOS%)", "嗜碱性粒细胞百分比(BASO%)", "淋巴细胞(LYM)",
                       "中性粒细胞(NEUT)", "单核细胞(MONO)", "嗜酸性粒细胞(EOS)","嗜碱性粒细胞(BASO)", "血小板比积(PCT)",
                       "血小板平均体积(MPV)", "血小板体积分布宽度(PDW)", "大血小板比率(P-LCR)",  "网织红细胞百分比(RET%)",
                       "网织红细胞(RET)", "未成熟网织红细胞比率(IRF)", "低荧光强度网织红细胞比率(LFR)", "中荧光强度网织红细胞比率(MFR)",
                       "高荧光强度网织红细胞比率(HFR)"],

    "X线": ["姓名", "性别", "年龄", "影像号", "住院号", "检查日期", "科室", "床号", "门诊号", "检查方法", "影像所见", "影像诊断",
                    "报告医生", "审核医生", "报告日期"],


    "血沉": ["姓名","性别","年龄","科室","床号","住院号","医生","临床诊断","标本类型","流水号","检验项目","标本编号","红细胞沉降率(ESR)"],

    "生化": ["姓名","性别", "年龄","科室","床号","住院号","医生",
                       "临床诊断","标本类型", "流水号","检验项目", "标本编号", "钾(K)",  "钠(Na)", "氯(CI)", "钙(Ca)",
                       "尿素(Urea)", "肌酐(Crea)", "尿素氮/肌酐(Bun/Crea)", "二氧化碳结合力(CO2-CP)", "葡萄糖(GLU)", "总蛋白(TP)",
                       "白蛋白(ALB)", "球蛋白(GLB)", "谷丙转氨酶(ALT)", "谷草转氨酶(AST)", "γ-谷氨酰基转移酶(GGT)", "总胆红素(TBIL)",
                       "碱性磷酸酶(ALP)", "胆碱酯酶(CHE)"],

    "MR": ["姓名","性别","年龄","检查日期","科室","床号","门诊号","影像号","住院号","检查方法","影像所见", "影像诊断","报告医生","审核医生","报告日期"],


    "CT": ["姓名","性别","年龄","检查日期","科室","床号","住院号", "门诊号", "影像号","检查方法","影像所见","影像诊断","报告医生","审核医生","报告日期"],


    "入院记录": ["姓名", "性别", "年龄", "科室", "床号", "住院号", "职业", "入科时间", "记录日期", "病史陈述者",
                 "婚姻", "主诉", "现病史", "既往史", "个人史", "婚育史", "家族史", "体温","脉搏","呼吸","血压", "一般情况",
                 "皮肤黏膜", "浅表淋巴", "头部及其器官检查", "颈部检查", "胸部检查", "腹部检查", "肛门", "外生殖器", "脊柱四肢",
                 "神经系统", "专科检查", "辅助检查", "入院诊断", "医师签名", "签名日期"],

    "出院记录": ["姓名", "性别", "年龄", "科室", "床号", "住院号", "入院日期", "手术日期", "手术名称", "伤口愈合",
                     "入院诊断", "出院诊断", "入院情况", "诊疗经过", "出院情况", "出院医嘱", "医师签名"],


    "手术记录": ["姓名","性别","年龄","科室","床号","住院号","术前诊断","手术名称","手术日期","术后诊断",
                     "麻醉方式","麻醉医生","手术医生","第一助手","第二助手","手术过程","记录日期"],

    "术前小结": ["姓名","性别","年龄","科室","床号","住院号","术前诊断","手术指征","参与讨论者姓名及专业技术职称",
                     "讨论日期","讨论内容(包括术前准备情况、手术方案、可能出现的意外及防范措施)","主持人总结意见","医师签名"],

    "病程记录": ["姓名","性别","年龄","科室","床号","住院号","首次病程记录日期", "首次病程记录",
                     "术前入院第一天查房记录日期","术前入院第一天查房记录",
                     "术前入院第二天查房记录日期", "术前入院第二天查房记录",
                     "术后当天手术病程记录日期",  "术后当天手术病程记录",
                     "术后第一天上级医生查房日期", "术后第一天上级医生查房记录",  "术后第二天查房记录日期",
                    "术后第二天查房记录", "术后第三天日常查房记录日期",  "术后第三天日常查房记录", "出院病程记录日期",
                    "出院病程记录"
                     ],
    "长期医嘱": ["姓名","性别","年龄","科室","床号","住院号","起始日期", "起始日期医生签名", "起始日期护士签名", "医嘱号", "长期医嘱", "每次量", "频率",
                       "用药途径", "停止日期", "停止日期医生签名", "停止日期护士签名", "备注"]

}